## Create a pandas dataframe with random data

In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
np.random.seed(101)

In [3]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [4]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [5]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [8]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [9]:
df['new'] = df['W'] + df['Z']

In [10]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [11]:
df.drop('W', 1)

          X         Y         Z       new
A  0.628133  0.907969  0.503826  3.210676
B -0.319318 -0.848077  0.605965  1.257083
C  0.740122  0.528813 -0.589001 -2.607169
D -0.758872 -0.933237  0.955057  1.143752
E  1.978757  2.605967  0.683509  0.874303

In [12]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [14]:
df.drop('W', 1, inplace=True)

In [15]:
df

          X         Y         Z       new
A  0.628133  0.907969  0.503826  3.210676
B -0.319318 -0.848077  0.605965  1.257083
C  0.740122  0.528813 -0.589001 -2.607169
D -0.758872 -0.933237  0.955057  1.143752
E  1.978757  2.605967  0.683509  0.874303

In [17]:
df.loc['A']

X      0.628133
Y      0.907969
Z      0.503826
new    3.210676
Name: A, dtype: float64

In [18]:
df.iloc[0]

X      0.628133
Y      0.907969
Z      0.503826
new    3.210676
Name: A, dtype: float64

In [24]:
df['Y'][2]

0.5288134940893595

In [25]:
df['Y']['C']

0.5288134940893595

In [36]:
#rows A, B, C Cols x and z
df[['X', 'Z']]['A' : 'C']

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001

In [37]:
df < 0

       X      Y      Z    new
A  False  False  False  False
B   True   True  False  False
C  False  False   True   True
D   True   True  False  False
E  False  False  False  False

In [38]:
df != 0

      X     Y     Z   new
A  True  True  True  True
B  True  True  True  True
C  True  True  True  True
D  True  True  True  True
E  True  True  True  True

In [39]:
df[df < 0]

          X         Y         Z       new
A       NaN       NaN       NaN       NaN
B -0.319318 -0.848077       NaN       NaN
C       NaN       NaN -0.589001 -2.607169
D -0.758872 -0.933237       NaN       NaN
E       NaN       NaN       NaN       NaN

In [40]:
bools = df < 0

In [41]:
df[bools]

          X         Y         Z       new
A       NaN       NaN       NaN       NaN
B -0.319318 -0.848077       NaN       NaN
C       NaN       NaN -0.589001 -2.607169
D -0.758872 -0.933237       NaN       NaN
E       NaN       NaN       NaN       NaN

In [42]:
df[df['Z'] < 0]

          X         Y         Z       new
C  0.740122  0.528813 -0.589001 -2.607169

In [43]:
df[df['Z'] < 0]

          X         Y         Z       new
C  0.740122  0.528813 -0.589001 -2.607169

In [45]:
df[(df['Z'] < 0) | (df['X'] > 0.5)]

          X         Y         Z       new
A  0.628133  0.907969  0.503826  3.210676
C  0.740122  0.528813 -0.589001 -2.607169
E  1.978757  2.605967  0.683509  0.874303